[M_IrisDL3_MySkag:MissionObjectiveSetBranchingDefinition_0 MissionObjectiveSetBranchingDefinition]
MissionDescriptionOverride="A man named Jerek has hired you to find his husband, whom he believes has turned into a skag.<br><br>As it turns out, Jerek's cheating husband, Uriah, was not a skag, and simply fled in order to avoid his comeuppance. Uriah has offered you a proposition: you can either fake his death by taking his scarf to Jerek, or you can kill Uriah and get paid anyway.<br><br>Uriah would obviously prefer you chose the former, but the choice is yours."

[M_IrisDL3_MySkag:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="A man named Jerek has hired you to find his husband, whom he believes has turned into a skag.<br><br>You found a group of skags in [place]Torgue Forge[-place], but none of them had a red scarf. Jerek has thusly asked you to kill all the skags in the area, just in case one of them happens to be his cheating husband."
